# include "iostream"
#include "Windows.h"
int main()
{
	using namespace std;
	SetConsoleOutputCP(65001);
	SetConsoleCP(65001);
	cout << "Приввіт гарний і чудових настрій!\n";

	//дЛЯ РОБОТИ З ЦИ КЛОМ FOR Є СПЕЦІАЛЬНИЙ СИНТАКСИС ЗАПИСУ
	int i = 0;
	i++; //оператор інкременту. Ідентично і+=1
	i--; //оператор декременто- i=i-1
	//Задача циклу: повтор декілька разів одної і тої смаої опреації. Кількість повторів може визначати якась змінна
	//Сиснтаксис for(ыныцыалызцыя змынних циклу. умова продовження циклу,лычильник циклу)
	//{тіло циклу}
	//інціалізація виконується один раз. Умова продовження циклу виконується  на кожній ітерації. 
	// Лічильник циклу- виконується кожен раз після тіла циклу
	//Зробимо цикл , який виводить числа від 1 до 10:
	//for (;;) //цикл у якому пропущені всі блоки. Вічний цикл
	int n = 10; 
	for(int i=1;i<=10;i++)
	{
		cout << i <<'\t'; //""- якщо більше двох символів
	}
	return 0;
}